## Pandas Tutorial

In [1]:
# Import Libraries

import pandas as pd
import numpy as np

### Basics & Math

In [5]:
sales_df = pd.read_csv('..\datasets\sales_data_sample.csv', sep=",", encoding='latin1')
sales_df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [6]:
# Get First 5 records
sales_df.head()

# Get Last 5 record
sales_df.tail()

# Get First 2 record
sales_df[:2]

# Get first 5 but 2 record interval
sales_df[:5:2]

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [7]:
# Get All indexes
sales_df.index.array

<NumpyExtensionArray>
[   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
 ...
 2813, 2814, 2815, 2816, 2817, 2818, 2819, 2820, 2821, 2822]
Length: 2823, dtype: int64

In [8]:
# Convert DataFram to to_numpy()

sales_df.to_numpy()

array([[10107, 30, 95.7, ..., 'Yu', 'Kwai', 'Small'],
       [10121, 34, 81.35, ..., 'Henriot', 'Paul', 'Small'],
       [10134, 41, 94.74, ..., 'Da Cunha', 'Daniel', 'Medium'],
       ...,
       [10386, 43, 100.0, ..., 'Freyre', 'Diego', 'Medium'],
       [10397, 34, 62.24, ..., 'Roulet', 'Annette', 'Small'],
       [10414, 47, 65.52, ..., 'Yoshido', 'Juri', 'Medium']], dtype=object)

In [9]:
dict_3 = {'One': pd.Series([1.,2.,3.], index=['a','b','c']),
          'Two': pd.Series([1.,2.,3.,4.], index=['a','b','c','d'])}
df_2 = pd.DataFrame(dict_3)
print(df_2)
print(df_2.fillna(0, inplace=True))
row = df_2.iloc[1]
df_2.add(row, axis='columns')
df_2

   One  Two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
None

   One  Two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  0.0  4.0

In [10]:
df_2.empty

False

In [11]:
# Add
df_5 = pd.DataFrame({'A': range(3), 'B': range(1,4)})
#Add
print(df_5.transform(lambda x: x+1))
#Square
print(df_5.transform(lambda x: x**2))
#Square Root
print(df_5.transform(lambda x: np.sqrt(x)))

   A  B
0  1  2
1  2  3
2  3  4
   A  B
0  0  1
1  1  4
2  4  9
          A         B
0  0.000000  1.000000
1  1.000000  1.414214
2  1.414214  1.732051

In [12]:
#Square on Two Different column
print(df_5.transform({'A':lambda x: x**2, 'B': lambda x: x**3}))

   A   B
0  0   1
1  1   8
2  4  27

In [13]:
print(df_5)
print(df_5['A'].map(lambda x: x**2))

   A  B
0  0  1
1  1  2
2  2  3
0    0
1    1
2    4
Name: A, dtype: int64

In [14]:
df_5['B'].unique()

array([1, 2, 3], dtype=int64)

In [15]:
df_5['B'].value_counts()

B
1    1
2    1
3    1
Name: count, dtype: int64

In [16]:
print(df_5.columns)
print(df_5.index)
print(df_5.isnull)

Index(['A', 'B'], dtype='object')
RangeIndex(start=0, stop=3, step=1)
<bound method DataFrame.isnull of    A  B
0  0  1
1  1  2
2  2  3>